# 1. Базовый образ: берем готовый Python версии 3.13 (облегченную версию)
FROM python:3.13-slim

# 2. Создаем рабочую папку /app внутри контейнера и переходим в нее
WORKDIR /app

# 3. Копируем файл с зависимостями в контейнер
COPY requirements.txt .

# 4. Устанавливаем все библиотеки из requirements.txt
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем весь остальной код проекта в контейнер
COPY . .

# 6. Команда, которая запустится при старте контейнера (запуск вашего бота)
CMD ["python", "src/bot.py"]